defmodule Onicn.Elements.Aluminum do
  use Onicn.Categories.Solid,
    cn_name: "铝"

  section "简介" do
    "铝是一种精炼金属，由铝矿精炼而得。"
  end

  section "用途" do
    "作为一种精炼金属，铝可以用来建造各种先进电力系统、建筑和自动化系统。"
    "铝可用于在太空服锻造台生产气压服。300 千克 铝 或 铜 或 铁 + 2 单位 芦苇纤维 = 1 件 气压服。"
    "铝的导热率高，比钻石还要高，仅次于导热质。适合用于建造导热用的金属砖，变温版和导热气体液体管道"
    "铝的熔点只有铁的一半，不适合用在极高温的环境下"
  end

  section "生产" do
    "金属精炼器能够将铝矿精炼成铝。100 千克 铝矿 = 100 千克 铝。"
    "当将铝矿喂食给光滑哈奇时，光滑哈奇会排泄出铝。此法约有75%的转化率。"
    "碎石机能够将铝矿粉碎成铝和沙子。100 千克 铝矿 = 50 千克 铝 + 50 千克 沙子。"
  end
end
