defmodule Onicn.Elements.CarbonDioxide do
  use Onicn.Categories.Gas,
    cn_name: "二氧化碳"

  section "简介" do
    "二氧化碳是一种不可呼吸的气体，常见于各个生态区。复制人呼吸时会排放出二氧化碳。"
  end

  section "用途" do
    "碳素脱离器能用水吸附二氧化碳变为污染水。1 千克/秒 水 + 300 克/秒 二氧化碳 = 1 千克/秒 污染水。"
    "储存在二氧化碳中的食物不会腐烂。"
    "人工种植夜幕菇和氧齿蕨需要二氧化碳环境。"
    "浮油生物呼吸二氧化碳，排泄出原油。熔岩浮油生物呼吸二氧化碳，排泄出石油。"
    "当处于二氧化碳环境时，藻类箱能够清除 333.33 毫克/秒二氧化碳。"
    "人工种植的氧齿蕨能够清除 625 毫克/秒二氧化碳。野生的氧齿蕨的效率为四分之一。 "
    content "二氧化碳引擎使用二氧化碳作为火箭动力。", only: :spaced_out
  end

  section "生产" do
    "复制人排放出 2 克/秒二氧化碳。"
    "煤炭发电机排放出 20 克/秒二氧化碳。"
    "木料燃烧器排放出 170 克/秒二氧化碳。"
    "天然气发电机排放出 22.5 克/秒二氧化碳。"
    "石油发电机排放出 500 克/秒二氧化碳。"
    "聚合压机排放出 8.33 克/秒二氧化碳。"
    "燃气灶排放出 25 克/秒二氧化碳。"
    "乙醇蒸馏器排放出 166.67 克/秒二氧化碳。"
    "二氧化碳喷孔定期排放出二氧化碳。"
    "火箭的石油引擎和固燃推进器会排放出二氧化碳。"
  end
end
