defmodule Onicn.Elements.Carbon do
  use Onicn.Categories.Solid,
    cn_name: "煤炭"

  summary "煤炭是一种常见于常温区和腐蚀区的消耗性矿石。它常用于煤炭发电机中作为燃料发电。好吃哈奇在进食之后会排泄煤。"

  usage "煤炭的最常见用途是作为煤炭发电机的燃料用来发电。1 千克/秒 煤炭 = 600 瓦 电力 + 20 克/秒 二氧化碳."
  usage "窑炉能将煤炭精炼成精炼碳，用来生产钢。125 千克 煤炭 = 100 千克 精炼碳。"
  usage "窑炉能够用粘土和煤炭烧制陶瓷。100 千克 粘土 + 25 千克 煤炭 = 100 千克 陶瓷。"
  usage "具有药物配制技能的复制人能在配药桌用煤炭来生产维生素咀嚼胶囊，服用后免疫力增加0.5。1 千克 煤炭 = 1 片 维生素咀嚼胶囊。"
  usage "具有药物配制技能的复制人能在配药桌用煤炭和水来生产治疗药片，治疗食物中毒。1 千克 煤炭 + 1 千克 水 = 1 片 治疗药片。"

  production "好吃哈奇、草质哈奇和石壳哈奇可以进食各种资源并排泄煤炭。光滑哈奇不会排泄煤炭。"
end
