defmodule Onicn.Elements.Ice do
  use Onicn.Categories.Solid,
    cn_name: "冰"

  section "简介" do
    "冰是一种水资源，大量存在于冰冻区。"
  end

  section "用途" do
    "冰是方便的水资源，在冰冻区的建筑释放出的热量会将冰自然融化成水。"
    "将冰储藏在浸没于水池中的容器内，可以用来冷却水。"
    "冰冷风扇可以消耗冰来给周围环境降温，消耗的冰会变成瓶装水。"
    "建造冰雕块需要400千克的冰作为建筑材料。冰雕块的基础装饰值高达+20，是游戏中最高的三个雕塑之一（另外两个是大理石雕块和金属雕块)。冰雕会在常温下融化，所以建议只在冰冻区建造。"
  end

  section "生产" do
    "冰在冰冻区大量存在。"
    "将水冷却至-2.65摄氏度（冰点-2摄氏度）会冻结成冰。"
    "将盐水降温至-9.5摄氏度（冰点-2摄氏度）会形成冰（77%质量）和浓盐水（23%质量）。"
    "制冰机可以冷却水制造冰。"
  end

  section "小技巧" do
    "把冰（以及其它可挖掘物体）会使质量减少50%。等待冰自然融化而不是挖掉可以得到两倍的水。"
  end
end
