defmodule Onicn.Elements.Iron do
  use Onicn.Categories.Solid,
    cn_name: "铁"

  summary "铁是一种精炼金属，由铁矿精炼而得。"

  usage "铁是炼钢的主要原料。精炼金属可以将铁、精炼碳和石灰炼成钢。70 千克 铁 + 20 千克 精炼碳 + 10 千克 石灰 = 100 千克 钢"
  usage "作为一种建筑材料，铁可以用来建造各种先进电力系统、建筑和自动化系统。"
  usage "铁可用于在太空服锻造台生产气压服。300 千克 铝 或 铜 或 铁 + 2 单位 芦苇纤维 = 1 件 气压服。"
  usage "固燃推进器使用铁作为燃料。每次太空任务固定消耗400千克铁。"

  production "金属精炼器能够将铁矿精炼成铁。100 千克 铁矿 = 100 千克 铁。"
  production "当将铁矿喂食给光滑哈奇时，光滑哈奇会排泄出铁。此法约有75%的生产效率。"
  production "碎石机能够将铁矿粉碎成铁和沙子。100 千克 铁矿 = 50 千克 铁 + 50 千克 沙子。"
  production "贫瘠区含有天然的铁。"
  production "太空区中的陨石雨会带来铁。"
end
