defmodule Onicn.Elements.Methane do
  use Onicn.Categories.Gas,
    cn_name: "天然气"

  summary "天然气是一种不可呼吸的气体，常用于发电。"

  usage "天然气发电机能够燃烧天然气发电。90 克/秒 天然气 = 800 瓦 电力 + 67.5 克/秒 污染水 + 22.5 克/秒 二氧化碳。"
  usage "燃气灶需要天然气作为燃料烹饪高级食物。100 克/秒 天然气 + 食物原料 = 25 克/秒 二氧化碳 + 高级食物。 "

  production "天然气间歇泉定期喷发出天然气。"
  production "具有胃肠胀气特质的复制人每隔 10 - 40 秒释放出100克天然气。"
  production "原油精炼器排放出天然气作为副产物。10 千克/秒 原油 = 5 千克/秒 石油 + 90 克/秒 天然气。"
  production "肥料合成器排放出天然气作为副产物。39 克/秒 污染水 + 65 克/秒 泥土 + 26 克/秒 磷矿 = 120 克/秒 肥料 + 10 克/秒 天然气。"
  production "油井在采油时产生 33.3 克/秒天然气。这些天然气储存在油井内部，当压力过高时需要复制人手动释放。"
  production "释气海牛食用释气草，排泄出天然气。"
end
