defmodule Onicn.Elements.Niobium do
  use Onicn.Categories.Solid

  section "简介" do
    "铌是一种稀有精炼金属，可以从太空任务获取。"
  end

  section "用途" do
    "分子熔炉能够用铌和钨合成导热质。5 千克 铌 + 95 千克 钨 = 100 千克 导热质。"
    "作为一种建筑材料，铌使得建筑的过热温度上升500摄氏度，并使得装饰值增加50%。"
  end

  section "生产" do
    "初始的铌只能自太空任务中获得。之后，金属精炼器可以用导热质生产铌。100 千克 导热质 = 100 千克 铌。"
    "碎石机可以将导热质粉碎成铌。100 千克 导热质 = 50 千克 铌 + 50 千克 沙子。（不推荐）"
  end

  section "小技巧" do
    "金属精炼器和分子熔炉构成了生产循环，铌扮演了催化剂角色，将钨转换成导热质。初始所需的少量铌需要通过太空任务获得。钨是难以再生的，玩家在生产时需注意合理分配资源。"
  end
end
