defmodule Onicn.Elements.Sand do
  use Onicn.Categories.Solid,
    cn_name: "沙子"

  summary "沙子是一种过滤介质，大量存在于常温区和盐池区中。"

  usage "沙子可以用于净水器来将污染水过滤成清水。5 千克/秒 污染水 + 1 千克/秒 沙子 或 浮土 = 5 千克/秒 水 + 200 克/秒 污染土。"
  usage "沙子可以用于空气净化器来将污染氧过滤成氧气。100 克/秒 污染氧 + 133.33 克/秒 沙子 或 浮土 = 90 克/秒 氧气 + 143.33 克/秒 粘土。"
  usage "沙子可以作为饲料喂食给好吃哈奇，好吃哈奇会排泄出煤炭。"
  usage "人工种植沙盐藤需要每周期施肥7千克沙子。"
  usage "玻璃熔炉能用沙子生产熔融玻璃。100 千克 沙子 = 25 千克 熔融玻璃。"

  production "大多数沙子来源于常温区和盐池区。沙子在腐蚀区也偶有出现。绿洲星体有大量高热的沙子。"
  production "碎石机能将盐和各种岩石粉碎成沙子。"
  production "抛壳蟹进食污染土和腐烂物，排泄沙子。"
  production "泥土加热至328.85摄氏度（熔点+2摄氏度）会变成沙子。"
end
