defmodule Onicn.Elements.SlimeMold do
  use Onicn.Categories.Solid,
    cn_name: "菌泥"

  section "简介" do
    "菌泥是一种有机物资源，常见于沼泽区。当环境气压小于1800克时，菌泥会释放出污染氧。"
  end

  section "用途" do
    "藻类蒸馏器能够将菌泥转化为藻类和污染水。600 克/秒 菌泥 = 200 克/秒 藻类 + 400 克/秒 污染水。"
    "菌泥可以作为饲料喂食给草质哈奇，草质哈奇会排泄出煤炭。"
    "使用菌泥作为诱饵建造飞行动物诱饵可以吸引喷浮飞鱼和贵族飞鱼。"
  end

  section "生产" do
    "沼泽区存在大量菌泥。"
    "喷浮飞鱼和贵族飞鱼呼吸污染氧并排泄出菌泥。"
  end

  section "小技巧" do
    "沼泽区的菌泥富含粘液肺病菌。空气净化器能够将污染氧转化为氧气。将菌泥储存于氯气环境下一周期可以杀灭粘液肺病菌。"
    "喷浮飞鱼排泄出的菌泥和废墟中的菌泥不含粘液肺病菌。"
  end
end
