defmodule Onicn.Elements.Tungsten do
  use Onicn.Categories.Solid

  section "简介" do
    "钨是一种精炼金属，由钨锰铁矿精炼而得。"
  end

  section "用途" do
    "分子熔炉能够将钨和铌合成导热质。5 千克 铌 + 95 千克 钨 = 100 千克 导热质。"
    "作为一种建筑材料，钨可以用来建造各种先进电力系统、建筑和自动化系统。但鉴于钨是导热质的主要原料，尽量避免将钨用于建筑用途。"
    "火箭发射时尾气温度极高，有时会熔化起飞路径周边的由其他金属制成的电线或自动化信号线。用钨建造相关线路可避免此问题。"
  end

  section "生产" do
    "金属精炼器能够将钨锰铁矿精炼成钨。100 千克 钨锰铁矿 = 100 千克 钨。"
    "当将钨锰铁矿喂食给光滑哈奇时，光滑哈奇会排泄出钨。此法约有75%的生产效率。"
    "碎石机能够将钨锰铁矿粉碎成钨和沙子。100 千克 钨锰铁矿 = 50 千克 钨 + 50 千克 沙子。"
  end
end
