defmodule Onicn.Buildings.EthanolDistillery do
  use Onicn.Categories.Building
  section "简介" do
    "乙醇蒸馏器能够将木料转化为乙醇，污染土和二氧化碳。"
    "乙醇通过输出管道排出，二氧化碳会直接排放到环境里，污染土会掉在地上。"
    "所有产出物都有最低温度，如果输入的木料温度更高则输出物温度也会升高。"
  end

  section "用途" do
    "主要目的为将木料转化为乙醇，乙醇可以输入石油发电机发电。"
  end

  section "小技巧" do
    "乙醇蒸馏器不会过热。"
    "1.8棵人工培育的乔木树可以提供1台乙醇蒸馏器需要的材料。"
    "1台乙醇蒸馏器可以喂养5只浮油生物。"
    "4台乙醇蒸馏器可以提供1个满效率运作的石油发电机的燃料。平均每个乙醇蒸馏器可以发电 260 瓦。如果产出的二氧化碳都通过熔岩浮油生物转化为石油再输入石油发电机，每个石油发电机需要3台乙醇蒸馏器和30个熔岩浮油生物。"
    "1台乙醇蒸馏器一周期可以产生200千克污染土，需要3.33个堆肥来处理为泥土（如果考虑复制人翻搅堆肥的时间，需要的数量会更多）。产出的泥土可以供应大概20棵乔木树，或者1.5个抛壳蟹或草质哈奇。"
    "黄金配比需要大量建筑，这里提供一个还可以的参考组合，建筑数量较少但不能保证所有建筑满效率运行："
    "  8个乔木树，4个乙醇蒸馏器，1台石油发电机。"
    "  或者6棵乔木树，3个乙醇蒸馏器，两台石油发电机，30个快乐（或120个闷闷不乐的）浮油生物。"
  end
end
