defmodule Onicn.Buildings.Generator do
  use Onicn.Categories.Building

  summary "煤炭发电机燃烧煤发电，排放二氧化碳并产生不少热量。"
  summary "煤炭发电机的容量为600千克煤，一次装满发的电可以充满9个巨型电池。"

  usage "煤炭发电机是很实用的发电方式。和人力发电机相比，煤炭发电机不需要复制人持续操作，但是要处理热量和二氧化碳。。"
  usage "使用智能电池控制之后可以能有效节约煤的消耗。"
  usage "和天然气发电机和石油发电机相比，它不需要处理额外的污水。"

  tips "饲养哈奇来保证煤的可持续供应。一个持续运行的发电机需要8.5个哈奇。"
  tips "虽然煤炭发电机的美术画有上方排气管，但游戏中它的二氧化碳排放点在下面一排。"
  tips "放在冰原里可以利用冰原温度让煤炭发电机降温，可以持续很多周期。"
  tips "因为会排放二氧化碳所以最好放在较低的位置方便二氧化碳沉淀。"
  tips "在电池充满后，如果发电机继续运行会浪费燃料。需要用自动化信号线连接智能电池。在只能电池快要充满的时候关闭发电机。"
  tips "复制人不会在发电机被禁用的时候装填燃料。"
  tips "用自动清扫器从附近的煤炭存储箱里自动装填燃料可以节约复制人的搬运时间。煤炭发电机的操作点在最下面中间的格子，要确保它在自动清扫器的范围里。"
  tips "煤炭发电机不需要氧气即可发电。"
end
