defmodule Onicn.Buildings.Grave do
  use Onicn.Categories.Building

  section "简介" do
    "雅致的纪念碑用于埋葬死亡的复制人。复制人会自动把尸体搬运进去。"
    "埋葬复制人并不会移出复制人的哀悼状态。"
    "埋葬完成的雅致的纪念碑可以拆除，尸体不会恢复。"
  end

  section "小技巧" do
    "装饰度低，建议不要放在复制人经常路过的地方。"
  end

  section "墓志铭" do
    "天下无不散之筵席。"
    "灰烬归灰烬，星尘归星尘。"
    "不再为时间所缚。"
    "“离开了我，你们也要好好活下去。”"
    "虽已离去，仍在我们心中。"
    "愿他安息。"
    "特立独行，直到我们再打印出一个来。"
    "这下我们再也没法知道他把宝藏埋哪儿了。"
    "把他的东西都拿走吧，他会高兴的。"
    "谢天谢地，他终于散发出气味了。"
    "他为自己所爱之事而亡。"
    "挖个坑，埋点土，一生到这就结束。"
    "一场冒险之旅的结束，是另一场冒险之旅的开始。"
    "亲爱的宠物和朋友。"
    "去了天国的农场。"
    "他们是最棒的男孩。"
    "她们是最好的女孩。"
  end
end
