defmodule Onicn.Buildings.LiquidConditioner do
  use Onicn.Categories.Building

  section "简介" do
    "液温调节器将输入液体管道的液体降温 14 °C 后输出，并将减少的热量转移到建筑自身。"
    "如果周围环境不能快速吸收液温调节器的热量，液温调节器很快就会过热。"
    "要避免过热建造材料需要提高过热温度，起码要用金汞齐，用钢更好。"
  end

  section "小技巧" do
    "通常和蒸汽涡轮机配合，利用蒸汽涡轮机来给液温调节器降温并将热能转为电力。"
    "由于消耗的电力不受降温的液体影响，因此使用比热容更大的液体可以提高液温调节器的降温效率，如果使用超级冷却剂，蒸汽涡轮机回收的电力甚至可以超过液温调节器消耗的电力。"
    "如果输入液体温度过低，输出温度低于凝固点，会使输出管道损坏，因此通常配合液体管道温度传感器控制输入液体的温度。"
    "这是唯一可以用来制造液氢也液氧的降温设备。"
  end

  section "不同冷却剂的效果（假设输入10kg/s）" do
    """
    | 液体种类   | 比热容 (DTU/°C)/g | 转移热量 DTU/s | 液温调节器（钢）升温 °C/s | 凝固点 °C | 沸点 °C |
    | ---------- | ----------------- | ------------- | ------------------------ |---------- |-------- |
    | 原油       | 1.690             |  236,600	     |   0.402                  |  -40.15   |  399.85 |
    | 石油       | 1.760             |  246,400	     |   0.419                  |  -57.15   |  538.85 |
    | 石脑油     | 2.191             |  306,740	     |   0.522                  |  -50.15   |  538.85 |
    | 乙醇       | 2.460             |  344,400	     |   0.586                  |  -114.05  |  78.35  |
    | 浓盐水     | 3.400             |  476,000	     |   0.522                  |  -22.50   |  102.75 |
    | 盐水       | 4.100             |  574,000	     |   0.976                  |  -7.50    |  99.69  |
    | 水         | 4.179             |  585,060	     |   0.995                  |  -0.65    |  99.35  |
    | 污染水     | 4.179             |  585,060	     |   0.995                  |  -20.65   |  119.35 |
    | 超级冷却剂 | 8.440             |  1,181,600	 |   2.010                  |  -271.15  |  436.85 |
    """
  end
end
